app/controllers/users_controller.rb

SELECT "users".* FROM "users"  ORDER BY "users"."id" DESC
---
  def index
    @users = User.all

INSERT INTO "users" ("name", "last_name", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", ""], ["last_name", ""], ["created_at", "2016-02-26 18:39:39.461910"], ["updated_at", "2016-02-26 18:39:39.461910"]]
---
  def create
    @user = User.create user_params

UPDATE "users" SET "avatar_file_name" = $1, "avatar_file_size" = $2, "avatar_updated_at" = $3, "updated_at" = $4 WHERE "users"."id" = $5  [["avatar_file_name", "bisiness-page-header.png"], ["avatar_file_size", 414672], ["avatar_updated_at", "2016-02-26 19:51:32.681601"], ["updated_at", "2016-02-26 19:51:32.893049"], ["id", 14]]
---
  def update
    @user.update_attributes user_params

SELECT  "users".* FROM "users" WHERE "users"."id" = $1  ORDER BY "users"."id" DESC LIMIT 1  [["id", 7]]
---
    def set_user
      @user = User.find(params[:id])